using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Homework4_task3
{
    class Program
    {
        static void Main(string[] args)
        {
            //Задание 3. Игра «Жизнь»
            char[,] charField = {   { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','O','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','O','O','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' },
                                    { '+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+','+' } };
            int fieldRows = charField.GetLength(0);
            int fieldCols = charField.GetLength(1);
            bool[,] cup = new bool[fieldRows, fieldCols];
            bool[,] cupNext = new bool[fieldRows, fieldCols];

            Console.CursorVisible = false;
            Console.Clear();
            for (int i = 0; i < fieldRows; i++)
            {
                for (int j = 0; j < fieldCols; j++)
                {
                    cup[i, j] = charField[i, j] == 'O';
                    cupNext[i, j] = charField[i, j] == 'O';
                    Console.Write(charField[i, j]);
                }
                Console.Write("\n");
            }
            while (true)
            {
                Console.WriteLine("Нажмите любую клавишу. Esc - выход.");
                if (Console.ReadKey().Key == ConsoleKey.Escape)
                {
                    break;
                }
                Console.Clear();
                for (int i = 1; i < fieldRows - 1; i++)
                {
                    for (int j = 1; j < fieldCols - 1; j++)
                    {
                        // (-1,-1) (-1,0) (-1,1)
                        // ( 0,-1) ( 0,0) ( 0,1)
                        // ( 1,-1) ( 1,0) ( 1,1)
                        int tmp11 = Convert.ToInt32(cup[i - 1, j - 1]);
                        int tmp12 = Convert.ToInt32(cup[i - 1, j]);
                        int tmp13 = Convert.ToInt32(cup[i - 1, j + 1]);
                        int tmp21 = Convert.ToInt32(cup[i, j - 1]);
                        int tmp22 = Convert.ToInt32(cup[i, j]);
                        int tmp23 = Convert.ToInt32(cup[i, j + 1]);
                        int tmp31 = Convert.ToInt32(cup[i + 1, j - 1]);
                        int tmp32 = Convert.ToInt32(cup[i + 1, j]);
                        int tmp33 = Convert.ToInt32(cup[i + 1, j + 1]);
                        int alive = tmp11 + tmp12 + tmp13 + tmp21 + tmp23 + tmp31 + tmp32 + tmp33;
                        //Условия жизни и смерти
                        if (!cup[i, j] && (alive == 3))
                        {
                            cupNext[i, j] = true;
                        }
                        else if (alive < 2 || alive > 3)
                        {
                            cupNext[i, j] = false;
                        }
                    }
                }
                for (int i = 0; i < fieldRows; i++)
                {
                    for (int j = 0; j < fieldCols; j++)
                    {
                        cup[i, j] = cupNext[i, j];
                        Console.Write(cup[i, j] ? "O" : "+");
                    }
                    Console.Write("\n");
                }
            }
        }
    }
}
